# Data Processing II

## Pandas

- a very high level package.

- built on top of Numpy  

- it can handle large datasets 
> even heterogenious data (str and int )

Pandas have 3 objects:   
1. Series objects  
2. Dataframe objects   
3. Index objects

- data = pd.series([[o.25,0.5,0.75,1.0]],index=[['a','b','c','d']])

> - you can give names to indices of series pandas

>  - acts more like dictionaries, where indices are defined as keys

> - Difference between Numpy arrays and pandas array is that you can rename pandas indices explicitly.

- data.values
> - the values provided in a panda series

- data.index

> - the keys/indices of the panda series

### Series Object

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.1.3'

In [3]:
A = pd.Series([2,3,5,6],index=['a','b','c','d'])

In [4]:
type(A)

pandas.core.series.Series

In [5]:
A.dtype

dtype('int64')

In [6]:
A.values

array([2, 3, 5, 6], dtype=int64)

In [7]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
type(A.values)    
#type of arrays

numpy.ndarray

In [9]:
type(A.index)
#type of indices

pandas.core.indexes.base.Index

In [10]:
#accessing elements in A using keys/indices
A['a']

2

In [11]:
A[0:2]

a    2
b    3
dtype: int64

#### Slicing

In [12]:
A[0:2]
#accessing part of A
# last index is not part of array

a    2
b    3
dtype: int64

In [13]:
A['a':'c']
#it should be noted when using indices the last key is included in the list unlike in the example above

a    2
b    3
c    5
dtype: int64

 ### DataFrame Objects

- its more tabular   
- relevant when keys in to dictionaries/Series objects are the same.

In [14]:
grades_dict = {'A':4, 'A-':3.5,'B':3, 'B-':2.5,'C':2}
grades = pd.Series(grades_dict)

In [15]:
grades

A     4.0
A-    3.5
B     3.0
B-    2.5
C     2.0
dtype: float64

In [16]:
marks_dict = {'A':85,'A-':80, 'B':75, 'B-':70, 'C':65}

In [17]:
marks

NameError: name 'marks' is not defined

In [ ]:
rs = pd.DataFrame({'grades':grades,'marks':marks_dict})

NameError: name 'grades' is not defined

In [ ]:
rs

    grades  marks
A      4.0     85
A-     3.5     80
B      3.0     75
B-     2.5     70
C      2.0     65

In [ ]:
garades = pd.Series([4,3.5,3,2.5],index = ['A','A-','B','C'])
marks = pd.Series([85,75,65,55],index = ['A','A-','B','C'])
#Both approaches gives us the same result
#Dictionaries or this

sheet = pd.DataFrame({'Gr':garades, 'Mr':marks} )

In [ ]:
sheet

     Gr  Mr
A   4.0  85
A-  3.5  75
B   3.0  65
C   2.5  55

In [ ]:
sheet["Gr"]   
#accessing 'Gr' column

A     4.0
A-    3.5
B     3.0
C     2.5
Name: Gr, dtype: float64

In [ ]:
sheet.columns

Index(['Gr', 'Mr'], dtype='object')

In [ ]:
sheet.values

array([[ 4. , 85. ],
       [ 3.5, 75. ],
       [ 3. , 65. ],
       [ 2.5, 55. ]])

In [ ]:
sheet.index

Index(['A', 'A-', 'B', 'C'], dtype='object')

In [ ]:
sheet['NewColumn'] = np.random.randint(1,10,4)
#adding new column with 4 random numbers between 1 and 9

In [ ]:
sheet

     Gr  Mr  NewColumn
A   4.0  85          9
A-  3.5  75          3
B   3.0  65          6
C   2.5  55          6

In [ ]:
sheet.rename(columns={'NewColumn':'ColC'})
#renaming columns

     Gr  Mr  ColC
A   4.0  85     9
A-  3.5  75     3
B   3.0  65     6
C   2.5  55     6

In [ ]:
sheet[sheet['Mr']>70]
# says from items in sheet dataFrame-Marks Columns, give me all items > 70
#rows values associated with the selected column are returned
#Boolean indexing

     Gr  Mr  NewColumn
A   4.0  85          9
A-  3.5  75          3

### Pandas (Indexing)

data = pd.Series([['a','b','c']],index=[[1,3,5]])

- data[[1]] - explicit index , use loc instead...returns 'a'  
- data[[1:3]] - implicit index / slicing , use iloc instead...returns values 'b' and 'c'

- loc = location, iloc = index location

rs.iloc[[2,3]]

In [ ]:
data = pd.Series (['a','b','c'],index = [1,3,5])

In [ ]:
data[1]

'a'

In [ ]:
data[1:3]

3    b
5    c
dtype: object

In [ ]:
data.loc[1:3]
#explicit indices

1    a
3    b
dtype: object

In [ ]:
data.iloc[1:3]
# implict indices

3    b
5    c
dtype: object

### Pandas (NaN)

- Missing values

In [ ]:
A = pd.DataFrame([{'a':1,"b":2},{'b':3,'c':4}])

In [ ]:
A

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

#### Handling missing values

#### 1. Dropping missing values

In [ ]:
A.dropna()
#this drops all rows containing Nan
#quite a compromise

Empty DataFrame
Columns: [a, b, c]
Index: []

#### 2. Filling with another number

In [ ]:
A.fillna(0)
#sometimes you just have to fill the columns with 0s

     a  b    c
0  1.0  2  0.0
1  0.0  3  4.0

- There are other functions on how to work with missing values

#### 3. Checking with IsNull (Boolean)

In [ ]:
A.isnull()
# checks which columns have Nan

       a      b      c
0  False  False   True
1   True  False  False

In [ ]:
A['b'].isnull()
#no Nan

0    False
1    False
Name: b, dtype: bool

In [ ]:
A['c'].isnull()

0     True
1    False
Name: c, dtype: bool

- this can be used for indexing

4. More DataFrame Manipulations

In [ ]:
df = pd.DataFrame(np.random.randint(0,10,(3,4)),columns=list('ABCD'))
df
#call random numbers and reshape to 3x4 matrix, list with column names ABCD

   A  B  C  D
0  1  7  6  7
1  3  6  5  1
2  2  5  3  2

In [ ]:
df2 = np.sin(df*np.pi/4)

In [ ]:
type(df2)

pandas.core.frame.DataFrame

In [ ]:
A = pd.DataFrame(np.random.randint(0,20,(2,2)),columns = list('AB'))
B = pd.DataFrame(np.random.randint(0,20,(3,3)),columns = list('BAC'))

In [ ]:
A

   A   B
0  1  16
1  1  18

In [ ]:
B

    B   A   C
0   8   2  11
1  19   1   8
2  13  13   4

In [ ]:
C = A + B
C

     A     B   C
0  3.0  24.0 NaN
1  2.0  37.0 NaN
2  NaN   NaN NaN

In [ ]:
A.add(B,fill_value = 0)

#any column in B without a matching  value in A is added with -100

      A     B     C
0   3.0  24.0  11.0
1   2.0  37.0   8.0
2  13.0  13.0   4.0

### Pandas (Combining DataFrames)

- pd.concat([[df1,df2]])
- pd.concat([[df3,df4]], axis='col')

 ### Pandas (Grouping)

 - df = pd.DataFrame({'key':[['A','B','C','A','B','C']],'values':range(6)},columns=[['key','values']])   

 - df.groupby('key').sum()

In [ ]:
df = pd.DataFrame({'key':list('ABCABC'), 'val':np.arange(6)},columns=['key','val'])
df

  key  val
0   A    0
1   B    1
2   C    2
3   A    3
4   B    4
5   C    5

In [ ]:
df.groupby('key').sum()

     val
key
A      3
B      5
C      7

- groupby function splits a data frame into constituent keys with the same name then in the above example calculates the sum of the grouped keys, and finally creating a new dataframe containing the sum of the numbers.

### Pandas (CSV files)

- pd.read_csv
> mainly used for machine learning

In [ ]:
 df = pd.read_csv('vgsales.csv')
 #if there is no header specify after ( vgsale.csv' header=None)

In [ ]:
df.shape

(16598, 11)

In [ ]:
df.columns

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

   - If no headers, we can define the columns
   >   df.columns = [[['C' + str(x)]] for x in range (df.shape[[1]])]

In [ ]:
df['Year']
#can access one column

0        2006.0
1        1985.0
2        2008.0
3        2009.0
4        1996.0
          ...
16593    2002.0
16594    2003.0
16595    2008.0
16596    2010.0
16597    2003.0
Name: Year, Length: 16598, dtype: float64

In [ ]:
df.loc[:,['Year','Genre']]
#explicit indexing
#for accessing more than one column
# : tells pandas to access  all rows with columns Year and Genre

         Year         Genre
0      2006.0        Sports
1      1985.0      Platform
2      2008.0        Racing
3      2009.0        Sports
4      1996.0  Role-Playing
...       ...           ...
16593  2002.0      Platform
16594  2003.0       Shooter
16595  2008.0        Racing
16596  2010.0        Puzzle
16597  2003.0      Platform

[16598 rows x 2 columns]

In [ ]:
df.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [ ]:
df.tail()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.0,0.0,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.0,0.0,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.0,0.0,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.0,0.0,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.0,0.0,0.01

In [ ]:
df['N  '].unique().size

KeyError: 'N  '

In [ ]:
df

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [ ]:
df['Genre'].unique()

array(['Sports', 'Platform', 'Racing', 'Role-Playing', 'Puzzle', 'Misc',
       'Shooter', 'Simulation', 'Action', 'Fighting', 'Adventure',
       'Strategy'], dtype=object)

In [ ]:
df2 = pd.get_dummies(df,columns = ['Name', 'Genre'])
df2

,Rank,Platform,Year,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Name_'98 Koshien,...,Genre_Fighting,Genre_Misc,Genre_Platform,Genre_Puzzle,Genre_Racing,Genre_Role-Playing,Genre_Shooter,Genre_Simulation,Genre_Sports,Genre_Strategy
0,1,Wii,2006.0,Nintendo,41.49,29.02,3.77,8.46,82.74,0,...,0,0,0,0,0,0,0,0,1,0
1,2,NES,1985.0,Nintendo,29.08,3.58,6.81,0.77,40.24,0,...,0,0,1,0,0,0,0,0,0,0
2,3,Wii,2008.0,Nintendo,15.85,12.88,3.79,3.31,35.82,0,...,0,0,0,0,1,0,0,0,0,0
3,4,Wii,2009.0,Nintendo,15.75,11.01,3.28,2.96,33.00,0,...,0,0,0,0,0,0,0,0,1,0
4,5,GB,1996.0,Nintendo,11.27,8.89,10.22,1.00,31.37,0,...,0,0,0,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,GBA,2002.0,Kemco,0.01,0.00,0.00,0.00,0.01,0,...,0,0,1,0,0,0,0,0,0,0
16594,16597,GC,2003.0,Infogrames,0.01,0.00,0.00,0.00,0.01,0,...,0,0,0,0,0,0,1,0,0,0
16595,16598,PS2,2008.0,Activision,0.00,0.00,0.00,0.00,0.01,0,...,0,0,0,0,1,0,0,0,0,0
16596,16599,DS,2010.0,7G//AMES,0.00,0.01,0.00,0.00,0.01,0,...,0,0,0,1,0,0,0,0,0,0
16597,16600,GBA,2003.0,Wanadoo,0.01,0.00,0.00,0.00,0.01,0,...,0,0,1,0,0,0,0,0,0,0

In [ ]:
df2.columns

Index(['Rank', 'Platform', 'Year', 'Publisher', 'NA_Sales', 'EU_Sales',
       'JP_Sales', 'Other_Sales', 'Global_Sales', 'Name_'98 Koshien',
       ...
       'Genre_Fighting', 'Genre_Misc', 'Genre_Platform', 'Genre_Puzzle',
       'Genre_Racing', 'Genre_Role-Playing', 'Genre_Shooter',
       'Genre_Simulation', 'Genre_Sports', 'Genre_Strategy'],
      dtype='object', length=11514)

In [ ]:
df.isnull().sum()

Rank              0
Name              0
Platform          0
Year            271
Genre             0
Publisher        58
NA_Sales          0
EU_Sales          0
JP_Sales          0
Other_Sales       0
Global_Sales      0
dtype: int64

In [ ]:
df.info()
#used to see if there is missing values.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [ ]:
df2.head()

,Rank,Platform,Year,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Name_'98 Koshien,...,Genre_Fighting,Genre_Misc,Genre_Platform,Genre_Puzzle,Genre_Racing,Genre_Role-Playing,Genre_Shooter,Genre_Simulation,Genre_Sports,Genre_Strategy
0,1,Wii,2006.0,Nintendo,41.49,29.02,3.77,8.46,82.74,0,...,0,0,0,0,0,0,0,0,1,0
1,2,NES,1985.0,Nintendo,29.08,3.58,6.81,0.77,40.24,0,...,0,0,1,0,0,0,0,0,0,0
2,3,Wii,2008.0,Nintendo,15.85,12.88,3.79,3.31,35.82,0,...,0,0,0,0,1,0,0,0,0,0
3,4,Wii,2009.0,Nintendo,15.75,11.01,3.28,2.96,33.00,0,...,0,0,0,0,0,0,0,0,1,0
4,5,GB,1996.0,Nintendo,11.27,8.89,10.22,1.00,31.37,0,...,0,0,0,0,0,1,0,0,0,0

In [ ]:
df2.to_csv('new.csv')

In [23]:
table_csv = pd.read_csv('zim-covd-stats.csv')
table_csv

,Entity,Code,Day,new_tests_per_thousand_7day_smoothed,142753-annotations,"Daily new confirmed cases of COVID-19 per million people (rolling 7-day average, right-aligned)",Year,Continent
0,Zimbabwe,ZWE,2020-05-13,32,tests performed,0.02871,2015,Africa
1,Zimbabwe,ZWE,2020-05-14,30,tests performed,0.02871,2015,Africa
2,Zimbabwe,ZWE,2020-05-15,26,tests performed,0.07671,2015,Africa
3,Zimbabwe,ZWE,2020-05-16,26,tests performed,0.06714,2015,Africa
4,Zimbabwe,ZWE,2020-05-17,26,tests performed,0.07686,2015,Africa
...,...,...,...,...,...,...,...,...
374,Zimbabwe,ZWE,2021-05-22,131,tests performed,1.20129,2015,Africa
375,Zimbabwe,ZWE,2021-05-23,130,tests performed,1.17243,2015,Africa
376,Zimbabwe,ZWE,2021-05-24,137,tests performed,1.19171,2015,Africa
377,Zimbabwe,ZWE,2021-05-25,130,tests performed,1.06686,2015,Africa
378,Zimbabwe,ZWE,2021-05-26,116,tests performed,1.98957,2015,Africa